#또다른 결측치 보안 방법으로는 ffill이 있다 이는 nan의 부분을 앞에 있는
#데이터로 채워주는 방법인데 nan인 열이 2개이상일때는 ffill자체에 limit을 걸어서
#난의 몇개까지를 채워줄건지를 따로 수정할수 있지만 이는 결측치를 정확히 파악하고 있을때만 해당된다.
import numpy as np
from numpy import nan as NA
import pandas as pd
np.random.seed(0)

sample_data_frame = pd.DataFrame(np.random.rand(10, 4))

sample_data_frame.iloc[1, 0] = NA
sample_data_frame.iloc[6:, 2] = NA

# 여기에 해답을 기술하세요
sample_data_frame.fillna(method="ffill")



# 0	1	2	3
# 0	0.548814	0.715189	0.602763	0.544883
# 1	0.548814	0.645894	0.437587	0.891773
# 2	0.963663	0.383442	0.791725	0.528895
# 3	0.568045	0.925597	0.071036	0.087129
# 4	0.020218	0.832620	0.778157	0.870012
# 5	0.978618	0.799159	0.461479	0.780529
# 6	0.118274	0.639921	0.461479	0.944669
# 7	0.521848	0.414662	0.461479	0.774234
# 8	0.456150	0.568434	0.461479	0.617635
# 9	0.612096	0.616934	0.461479	0.681820